class User < ApplicationRecord
  #код ниже из гема bcrypt, который хеширует пароль и добавляет два вирутальных метода для пароля, которые не видны в таблицы, но их можно вызыать на образце класса.
  #эти атрибуты будут нужны чтоб пользователь на страничке формы мог ввести пароль, потом его используем и в базу попадет только password_digest
  has_secure_password
#uniqueness чтобыне было одинаковых майлов, эти проверки на уровне кода, то есть они не сработают если писать запрос в бд анпрямую. НО в db где пишем там уже серрьзгные проверки
  validates :email, presence: true, uniqueness: true
  
end
